import 'package:intl/intl.dart';

class Utilities {
  formatNumber(double number) {
    return NumberFormat.compact().format(number);
  }

  final NumberFormat format = NumberFormat.decimalPattern();

  String beforeFrctional(double value) {
    return NumberFormat().format(double.parse(
        value.toString().substring(0, value.toString().indexOf('.'))));
  }

  static String get paragraph =>
      '''ولأن هذه الألفاظ المجازية لن تدوم طويلاً، ولن نستدلّ بها - في نهاية المطاف - على شيء، اذن يجب أن نضعها في أكياس بلاستيكية، ونعلّقها عالحيطة في وشّ الأسانسير، علشان القطط ماتاكلش منها. وننساها، ونعود الى أوراقنا موصدين الباب بإحكام.
نتنحنح، ونقول: البتاع. كلمة تدلّ على لا شيء، وعلى كلّ شيء. وهي مركز أبحاث شعبية كثيرة، تتعجّب من غرابتها والقومية المصرية الخاصة التي تعكسها، الى جانب الشيء الكثير من العفوية وحلاوة الروح. نعم، نحن قرأنا وسمعنا وعرفنا كل هذا. لكنه محلّ اهتمامنا اليوم لأسباب غير تلك الأسباب. كذلك، فإننا لعاقدون عزمنا على أن نتجاوز قضية الفصحى والعامية، وثنائية النخبة والرعاع، التي كثيراً ما ينحو نحوها الحديث عن الكلمة المذكورة. وفوق هذا كله، لسنا بصدد تفسير معاني "البتاع" كما تأتي في قصيدة الحاج أحمد فؤاد نجم، ولا التحذلق والتفذلك في الألغاز والأسرار المكنونة.
هذا البتاع - أم هذه البتاع؟ - يثيرنا للإمكانيات التي يفتحها لنا، والألعاب الجديدة التي يصوغها لأجلنا، ومنها: 1) طرح أسئلة حول البلاغة، والرأسمال الثقافي، ثم 2) أن نأكل من ثمرته، ثم أن نضعه مثله مثل الألفاظ الأخرى في كأس من البلاستيك نعلّقه عالحيطة قدام الأسانسير. علشان أمّ حسنية ماتزعلش.
على الصعيد العالمي (وليس فقط السياق العربي-المصري المحدود)، توافق الناس وتواضعوا على أن تنشأ للبلاغة قيمة، يحتفظ بها المحظوظون والمختارون، يبيعونها مقابل حصولهم على المكانة الاجتماعية المحترمة ومنها ممارسة الجنس والتكاثر في نوعهم الخ. ومعنى ذلك أن يتمّ نبذ من يتّسم كلامه بالتهتهة، والهلضمة، والصعوبة في التواصل مع الآخرين بشكل عام. إلا أن الطرق أمام البؤساء كانت وما زالت مسدودة، وذلك لحصرها على طرق معينة ومحدودة جدا اختارها ومهّدها أهل الحلّ والربط. أمّا أهل التلجلج والتلعثم، فقد أتقنوا وأجادوا طرق غير تلك الطرق، ألا وهي طرق البذاءة والإفاضة والتبلبل والبتاع. أي أنّهم ظلّوا في البادية، وضيق عليهم الحبس لما كانوا عليه من انحراف وشذوذ. وتجمّدوا في أماكنهم، نظراً لما مورس عليهم من " إرهاب لغوي " كما تسمّيه الأستاذة كرستن بروستاد''';
}
